[
    {
        "id":5,
        "company":"Microsoft",
        "position":"Software Engineer II",
        "dates":"August 2022 to Present",
        "description":[
            "Researched under-performing areas of Azure server using tools like ETW and flame graphs.",
            "Proved that the use of a different memory allocator would reduce CPU usage by 57% for local storage workloads.",
            "Identified and fixed a bottleneck in local storage workloads that increased throughput by 68%.",
            "Placed 3rd of 34 teams in a company sponsored Hack the Box CTF event."
        ]
    },
    {
        "id":4,
        "company":"Purdue University",
        "position":"Head Graduate Teaching Assistant",
        "dates":"January 2021 to May 2022",
        "description":[
            "Recipient of the 2022 “Graduate Teaching Assistant of the Year” award from the ACM student chapter.",
            "Lectured 200 students on computer architecture during the professor's absence.",
            "Taught two lab sections of 24 students every week on course concepts such as ARM assembly and building circuits.",
            "Coordinated all computer architecture GTAs on course issues like covid related absences and grading."
        ]
    },
    {
        "id":3,
        "company":"Epic",
        "position":"Software Engineering Intern",
        "dates":"May to August 2020",
        "description":[
            "Proposed a new method of growth chart graphing to allow physicians to easily identify abnormalities in babies.",
            "Designed and conducted a feature usability study including both national and international customers.",
            "Refactored a graphing module using C# and React to reduce cyclomatic complexity by 88%.\n\n"
        ]
    },
    {
        "id":2,
        "company":"Purdue University",
        "position":"Resident Assistant",
        "dates":"August 2019 to December 2020",
        "description":[
            "Promoted an inclusive community on the floor by planning and hosting weekly events for 50 residents.",
            "Mediated conflicts between roommates to provide resolution in a timely manner.",
            "Interviewed potential Resident Assistant candidates for the following school year."
        ]
    },
    {
        "id":1,
        "company":"Quicken Loans",
        "position":"Software Engineering Intern",
        "dates":"May to July 2019",
        "description":[
            "Designed a web application with Angular to manage and track the intake of new tech ideas at Quicken Loans.",
            "Enabled application hosting by configuring infrastructure on AWS, including S3s, Lambdas, and API Gateways.",
            "Contributed to a feature that reduced the processing time of escrow deletion from 60 days to 8 days.",
            "Gained experience in SAFe practices through daily standups, release planning, retrospectives, and design sessions."
        ]
    }
]
